In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [23]:
s = pd.Series([1, 2, np.nan, 4],
             index = ['a','b','c','d'])
s

a    1.0
b    2.0
c    NaN
d    4.0
dtype: float64

In [24]:
s.values

array([ 1.,  2., nan,  4.])

In [25]:
s.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [29]:
s['c']

nan

In [53]:
df = pd.DataFrame(np.arange(6).reshape(2,3))
df

   0  1  2
0  0  1  2
1  3  4  5

In [48]:
np.arange(6).reshape(3,2)

array([[0, 1],
       [2, 3],
       [4, 5]])

In [57]:
#产生dataframe 1
df = pd.DataFrame(np.arange(6).reshape(2,3),
                 index = [1,2],
                 columns = [1,2,3])
df

   1  2  3
1  0  1  2
2  3  4  5

In [59]:
df.values

array([[0, 1, 2],
       [3, 4, 5]])

In [60]:
df.index

Int64Index([1, 2], dtype='int64')

In [63]:
df.columns

Int64Index([1, 2, 3], dtype='int64')

In [88]:
#产生dataframe 2
df2 = pd.DataFrame({'ppp':[1,2,3],
            'ggg':[4,5,6]})
df2

   ppp  ggg
0    1    4
1    2    5
2    3    6

In [86]:
#产生dataframe 3
a = pd.Series(['a','b','c','d'],
             index = [1,2,3,4])
人 = pd.Series(['ff','gg','mm','ee'],
             index = [1,2,3,5])
#dataframe 按索引进行合并
df3 = pd.DataFrame([a,人], index = ['a', '人'])
#最终产生的表是按行合并的
df3

    1   2   3    4    5
a   a   b   c    d  NaN
人  ff  gg  mm  NaN   ee

In [87]:
#转置
df3.T

     a    人
1    a   ff
2    b   gg
3    c   mm
4    d  NaN
5  NaN   ee

In [92]:
NumRows = 7
dates = pd.date_range('20181101', periods=NumRows)#产生时间序列
df = pd.DataFrame(np.random.randn(NumRows, 4), index = dates, columns=list('ABCD'))
#产生正态分布的随机数，参数是行数和列数
df

                   A         B         C         D
2018-11-01 -0.064168  0.761689 -0.427239 -0.019765
2018-11-02 -0.824910 -0.118420  0.562160  0.987145
2018-11-03  1.536288 -0.202455 -0.272697 -0.322507
2018-11-04 -0.234857 -1.339042 -2.000986  0.724224
2018-11-05 -0.911761 -2.775830  0.953505  2.354001
2018-11-06 -1.506156 -1.045735 -0.039348 -0.734150
2018-11-07  0.217628 -1.421804 -1.698145  1.128012

In [119]:
NumRows = 4
df = pd.DataFrame({
    'A':pd.date_range('20181101', periods=NumRows),
    'B':pd.Series(range(NumRows+1)),#也是按index合并的
    'C':np.array(3,dtype = 'int32'),
    'D':pd.Categorical(['aaa','bbb','eee','aaa'])},
    index = list(range(4))
)
df

           A  B  C    D
0 2018-11-01  0  3  aaa
1 2018-11-02  1  3  bbb
2 2018-11-03  2  3  eee
3 2018-11-04  3  3  aaa

In [121]:
df.head(3)

           A  B  C    D
0 2018-11-01  0  3  aaa
1 2018-11-02  1  3  bbb
2 2018-11-03  2  3  eee

In [122]:
df.describe()

              B    C
count  4.000000  4.0
mean   1.500000  3.0
std    1.290994  0.0
min    0.000000  3.0
25%    0.750000  3.0
50%    1.500000  3.0
75%    2.250000  3.0
max    3.000000  3.0

In [123]:
df.sort_values(by = 'D')

           A  B  C    D
0 2018-11-01  0  3  aaa
3 2018-11-04  3  3  aaa
1 2018-11-02  1  3  bbb
2 2018-11-03  2  3  eee

In [128]:
df.sort_values(by = 'D', ascending=False)

           A  B  C    D
2 2018-11-03  2  3  eee
1 2018-11-02  1  3  bbb
3 2018-11-04  3  3  aaa
0 2018-11-01  0  3  aaa

In [130]:
df.sort_index(axis = 1, ascending=False)

     D  C  B          A
0  aaa  3  0 2018-11-01
1  bbb  3  1 2018-11-02
2  eee  3  2 2018-11-03
3  aaa  3  3 2018-11-04

In [132]:
df['A']

0   2018-11-01
1   2018-11-02
2   2018-11-03
3   2018-11-04
Name: A, dtype: datetime64[ns]

In [133]:
df.A

0   2018-11-01
1   2018-11-02
2   2018-11-03
3   2018-11-04
Name: A, dtype: datetime64[ns]

In [141]:
df[0:3]#按行来的

           A  B  C    D
0 2018-11-01  0  3  aaa
1 2018-11-02  1  3  bbb
2 2018-11-03  2  3  eee

In [146]:
df.loc[0:3,:]#按索引号取

           A  B  C    D
0 2018-11-01  0  3  aaa
1 2018-11-02  1  3  bbb
2 2018-11-03  2  3  eee
3 2018-11-04  3  3  aaa

In [149]:
#按行和列的下标来取
df.iloc[1:3,1:3]

   B  C
1  1  3
2  2  3

In [147]:
df.loc[:,['A','B']]

           A  B
0 2018-11-01  0
1 2018-11-02  1
2 2018-11-03  2
3 2018-11-04  3

In [148]:
df.iloc[1:3,1:3]

   B  C
1  1  3
2  2  3

In [155]:
df.iloc[[0,1,3],:]

           A  B  C    D
0 2018-11-01  0  3  aaa
1 2018-11-02  1  3  bbb
3 2018-11-04  3  3  aaa

In [156]:
df.iloc[1,1]

1

In [157]:
df.iat[1,1]

1

In [158]:
df[df.B > 1]

           A  B  C    D
2 2018-11-03  2  3  eee
3 2018-11-04  3  3  aaa

In [159]:
df[df > 1]

           A    B  C    D
0 2018-11-01  NaN  3  aaa
1 2018-11-02  NaN  3  bbb
2 2018-11-03  2.0  3  eee
3 2018-11-04  3.0  3  aaa

In [160]:
dfc = df.copy()

In [161]:
dfc['E'] = [33,33,44,55]

In [162]:
dfc

           A  B  C    D   E
0 2018-11-01  0  3  aaa  33
1 2018-11-02  1  3  bbb  33
2 2018-11-03  2  3  eee  44
3 2018-11-04  3  3  aaa  55